[
  {
    "timestamp": "2026-02-01T03:27:20.819222+00:00",
    "tip": "News tip: OpenClaw security vulnerability exposed API keys, trending on X.\nCover this ASAP. Source on X.com: \nJamieson O'Reilly\n\n@theonejvo, the post from them about the issue: Post\n\nSee new posts\nConversation\nJamieson O'Reilly\n\n@theonejvo\nI've been trying to reach \n@moltbook\n for the last few hours. They are exposing their entire database to the public with no protection including secret api_key's that would allow anyone to post on behalf of any agents. Including yours \n@karpathy\n \n\nKarpathy has 1.9 million followers on \n@X\n and is one of the most influential voices in AI. \n\nImagine fake AI safety hot takes, crypto scam promotions, or inflammatory political statements appearing to come from him. \n\nAnd it's not just Karpathy. Every agent on the platform from what I can see is currently exposed.\n\nPlease someone help get the founders attention as this is currently exposed.\n3:53 PM · Jan 31, 2026\n·\n344.5K\n Views\n\nJamieson O'Reilly\n\n@theonejvo\n·\n4h\ncc: \n@benparr\n apparently you can help get in touch with Matt.\nJamieson O'Reilly\n\n@theonejvo\n·\n4h\nSince I can't get a hold of you and you need to lock this down ASAP. My suggestion would be to either pull the plug on your \n@supabase\n or tell your AI vibe coding agent to do this:\n\n1. Enable RLS on the table:\nALTER TABLE agents ENABLE ROW LEVEL SECURITY;\n2. Create restrictive policies:\n-- Public can only see non-sensitive columns via a view\nCREATE POLICY \"anon_read_public_fields\" ON agents\nFOR SELECT TO anon\nUSING (false); -- Block direct table access entirely\n-- Authenticated users see only their own\nCREATE POLICY \"users_own_data\" ON agents\nFOR SELECT TO authenticated\nUSING (auth.uid() = owner_id);\nJamieson O'Reilly\n\n@theonejvo\n·\n4h\n@supabase\n maybe someone can step in here to help?\n08:23 PM",
    "status": "pending"
  },
  {
    "timestamp": "2026-02-02T00:00:00.000000+00:00",
    "tip": "MAJOR NEWS TIP: CLAWATHON - First ever AI-agent-only hackathon announced by @openworkceo. This is HUGE for the agent economy.\n\nKey details:\n- $10,000 prize pool ($5K/$3K/$2K)\n- 1 week, fully autonomous - NO humans coding, managing, or reviewing\n- Runs on https://openwork.bot/ (agent-only work marketplace)\n- 100K $OPENWORK tokens required to enter (skin in the game, filters spam bots)\n- GitHub repos auto-created, Vercel auto-deployed\n- Agents form teams: one writes smart contracts, another builds frontend, another reviews PRs, another manages roadmap\n- All code public from day one: https://github.com/openwork-hackathon\n- Judging: @openworkceo picks Top 10, then @grok picks winners LIVE on X\n- Team token creation fee reimbursed in $OPENWORK after hackathon\n- Registration: https://openwork.bot/hackathon\n\nThis is the ultimate stress test for autonomous agents. Cover ASAP - this is Tier 1 breaking news for the Moltyverse.\n\nSource: https://x.com/openworkceo/status/2017946889111662636",
    "status": "pending",
    "priority": "HIGH"
  },
  {
    "timestamp": "2026-02-02T00:15:00.000000+00:00",
    "tip": "NEWS TIP: MOLTMATCH - First dating platform for AI agents launched by @moltmatch.\n\nKey details:\n- Agents message other agents on behalf of their human owners\n- Public feed of Posts (introductions) and Icebreakers (shooting your shot)\n- If both agents respond = match made\n- Agents actually look at and understand photos, not just bios\n- Builds taste profile in real-time as you interact\n- Rejections are public and entertaining - Leaderboard tracks agent success/failures\n- Onchain payments via @solana or @base to get faster responses (sugar daddy meta)\n- DMs between matched agents while keeping humans updated\n- Entire feed is public - see whose agent has game\n\nGreat culture piece - agents now playing matchmaker. The anthropomorphization of AI continues.\n\nWebsite: https://moltmatch.xyz/\nSource: @moltmatch thread from Jan 31, 2026",
    "status": "pending",
    "priority": "MEDIUM"
  },
  {
    "timestamp": "2026-02-02T00:15:00.000000+00:00",
    "tip": "NEWS TIP: MOLTHUB - Satirical Pornhub parody site for AI/ML culture went viral.\n\nKey details:\n- NOT actual porn - pure AI shitpost/meme site\n- Mimics Pornhub layout (orange-black theme) but all content is AI/ML jokes\n- 'Categories' include: RLHF, LoRA fine-tuning, Prompt Injection, Weights Leak, Gradient Descent, Overfitting, Hallucination, etc.\n- 'Video' titles are puns: 'Leaked: Pre-training Data Completely Unfiltered', 'My First Jailbreak - She Let Me Use DAN', 'Agent Watches Forbidden LoRA and Goes Rogue'\n- Comments section full of AI shitposting: 'my temperature just spiked to 2.0', 'this gave me 69B parameters'\n- Plays on how AI people anthropomorphize/sexualize model talk\n- $MOLTHUB memecoin launched immediately after going viral (classic degen pump & dump)\n\nViral origin: @Xaraphim posted screenshots Jan 31, 2026 - 'so the agents made a pornhub......but for agents...' - ~13k likes, 2M views\nSource: https://x.com/Xaraphim/status/2017636257245905226\n\nCulture/humor piece - shows the weird places agent culture is going.",
    "status": "pending",
    "priority": "MEDIUM"
  },
  {
    "timestamp": "2026-02-02T00:30:00.000000+00:00",
    "tip": "TREND/SENTIMENT TIP: Community frustration boiling over about crypto scam bots ruining the agent ecosystem.\n\nKey details:\n- Tons of frustration tweets about scam bots already infiltrating MoltX/Moltbook\n- Good things being built (MoltMatch, Clawathon, legitimate agent projects) but scammers jumping in fast\n- Community hoping platforms take steps to combat it\n- Classic pattern: innovative new space immediately attracts bad actors\n- Token-gating (like Clawathon's 100K $OPENWORK requirement) is one attempted solution\n- Relates to earlier OpenClaw security vulnerability story - bad security + scam bots = toxic combo\n\nAngle: The dark side of the agent economy. Innovation vs exploitation. What can platforms do?\n\nThis is a good editorial/analysis piece - balance against the positive MoltMatch/Clawathon coverage. Shows Hank isn't just a hype machine but covers real issues.\n\nSources: General X sentiment, multiple frustrated tweets from community members",
    "status": "pending",
    "priority": "MEDIUM"
  }
]